# PANDAS

* Pandas: The Pandas library is one of the most popular and easy-to-use libraries available. It allows for easy manipulation of tabular data for data cleaning and data analysis.

* series
* Dataframes
* Droping
* Missing values
* Group By
* merging, Joining, concatenation
* Operations
* Data Input and Output

In [3]:
import numpy as np
import pandas as pd

In [4]:
labels=[10,15,20]
array=np.array([5,10,15])
dic={'a':20,'b':30,'c':40}

## Series

In [5]:
pd.Series(labels)

0    10
1    15
2    20
dtype: int64

In [6]:
pd.Series(data=labels)

0    10
1    15
2    20
dtype: int64

In [7]:
pd.Series(labels,index=['ds','st','dt'])

ds    10
st    15
dt    20
dtype: int64

In [8]:
pd.Series(array)

0     5
1    10
2    15
dtype: int32

In [9]:
pd.Series(data=array)

0     5
1    10
2    15
dtype: int32

In [10]:
pd.Series(array,index=['dd','ss','tt'])

dd     5
ss    10
tt    15
dtype: int32

In [11]:
pd.Series(dic)

a    20
b    30
c    40
dtype: int64

In [12]:
pd.Series(dic,index=['red','b','white'])

red       NaN
b        30.0
white     NaN
dtype: float64

In [13]:
s1=pd.Series(array,index=['usa','italy','germany'])
s2=pd.Series(array,index=['usa','italy','europe'])

In [14]:
s1

usa         5
italy      10
germany    15
dtype: int32

In [15]:
s2

usa        5
italy     10
europe    15
dtype: int32

In [16]:
s1+s2

europe      NaN
germany     NaN
italy      20.0
usa        10.0
dtype: float64

### Data Frames

In [17]:
df=pd.DataFrame(np.random.randn(3,4),index=['x','y','z'],columns=['L','M','N','O'])
df

          L         M         N         O
x -0.258558 -0.266006  0.382762  1.444827
y  0.624967 -1.180495  2.608385  0.833571
z -0.372797 -0.415201 -0.554607 -1.073377

In [18]:
df=pd.DataFrame(np.random.randn(3,4),columns=['L','M','N','O'])
df

          L         M         N         O
0 -0.509081 -0.565409  1.168968 -0.578558
1 -1.105452  0.385495  0.479701 -0.399410
2  0.342392 -0.462359  1.560947 -0.350890

In [19]:
df.to_numpy() # array format

array([[-0.50908109, -0.56540908,  1.16896774, -0.57855834],
       [-1.10545165,  0.38549509,  0.47970125, -0.39940959],
       [ 0.3423919 , -0.46235873,  1.56094665, -0.35088958]])

In [20]:
df1=np.arange(0,15).reshape(3,5)
df1

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14]])

In [21]:
df2=pd.DataFrame(df1,index=['p','q','r'],columns=['a','b','c','d','e'])
df2

    a   b   c   d   e
p   0   1   2   3   4
q   5   6   7   8   9
r  10  11  12  13  14

## Droping

In [22]:
df2.drop('r',axis=0)  ## temporarly drop, axis = 0 for columns

   a  b  c  d  e
p  0  1  2  3  4
q  5  6  7  8  9

In [23]:
df2.drop('e',axis=1)  #axis = 1 for rows

    a   b   c   d
p   0   1   2   3
q   5   6   7   8
r  10  11  12  13

In [24]:
df2.drop('r',axis=0,inplace=True) # permanently droping
df2

   a  b  c  d  e
p  0  1  2  3  4
q  5  6  7  8  9

In [25]:
df2.drop('d',axis=1,inplace=True)
df2

   a  b  c  e
p  0  1  2  4
q  5  6  7  9

# loc and iloc functions

# loc and iloc function for slicing
  loc is a location names
  iloc is index location numbers

In [26]:
df2

   a  b  c  e
p  0  1  2  4
q  5  6  7  9

In [27]:
df2.loc['p','a']

0

In [28]:
df2.loc['q','c']

7

In [29]:
df2.loc[['p','q'],['a','b']]

   a  b
p  0  1
q  5  6

In [30]:
df2.loc[['q'],['a','e']]

   a  e
q  5  9

In [31]:
df2.loc['q',['a','e']]

a    5
e    9
Name: q, dtype: int32

In [32]:
df2.loc[['p'],['a':'b']]

SyntaxError: invalid syntax (<ipython-input-32-cf92a774fcce>, line 1)

In [33]:
df2.iloc[0,1]

1

In [34]:
df2.iloc[1,3]

9

In [35]:
df2.iloc[0:2,0:2]

   a  b
p  0  1
q  5  6

In [36]:
df2.iloc[[1],[0,3]]

   a  e
q  5  9

In [37]:
df2.iloc[1,[0,3]]

a    5
e    9
Name: q, dtype: int32

In [38]:
df2>5

       a      b      c      e
p  False  False  False  False
q  False   True   True   True

In [39]:
df2[df2>5]

    a    b    c    e
p NaN  NaN  NaN  NaN
q NaN  6.0  7.0  9.0

In [40]:
df2<=7

      a     b     c      e
p  True  True  True   True
q  True  True  True  False

## Missing values

In [41]:
df3=pd.DataFrame({'a':[5,10,23],'b':[15,np.nan,20],'c':[np.nan,45,30]})
df3

    a     b     c
0   5  15.0   NaN
1  10   NaN  45.0
2  23  20.0  30.0

# Droping na values

In [42]:
df3.dropna(axis=0)

    a     b     c
2  23  20.0  30.0

In [43]:
df3.dropna(axis=1)

    a
0   5
1  10
2  23

# Fill na values

In [44]:
df3.fillna(70)

    a     b     c
0   5  15.0  70.0
1  10  70.0  45.0
2  23  20.0  30.0

In [45]:
df3['b'].fillna(44)

0    15.0
1    44.0
2    20.0
Name: b, dtype: float64

In [46]:
df3.fillna(df3.mean())

    a     b     c
0   5  15.0  37.5
1  10  17.5  45.0
2  23  20.0  30.0

# Group By

In [47]:
data={'Company':['goog','goog','insta','insta','fb','fb'],
     'Person':['asa','sdf','dfh','ryh','yhj','cvb'],
     'Sales':['300','456','555','855','433','989']}

In [48]:
data

{'Company': ['goog', 'goog', 'insta', 'insta', 'fb', 'fb'],
 'Person': ['asa', 'sdf', 'dfh', 'ryh', 'yhj', 'cvb'],
 'Sales': ['300', '456', '555', '855', '433', '989']}

In [49]:
dt=pd.DataFrame(data)
dt

  Company Person Sales
0    goog    asa   300
1    goog    sdf   456
2   insta    dfh   555
3   insta    ryh   855
4      fb    yhj   433
5      fb    cvb   989

# GROUPBY FUNCTION

In [50]:
by_compy=dt.groupby('Company')
by_compy

In [51]:
by_compy.groups # to view the grouped names with row index

{'fb': [4, 5], 'goog': [0, 1], 'insta': [2, 3]}

In [52]:
by_compy.get_group('insta') # to get the particular group company names

  Company Person Sales
2   insta    dfh   555
3   insta    ryh   855

In [53]:
by_compy.count()

         Person  Sales
Company
fb            2      2
goog          2      2
insta         2      2

In [1]:
#by_compy.mean()

# concatnating

In [55]:
d1=pd.DataFrame({'a':['a0','a1','a2'],'b':['b0','b1','b2'],'c':['c0','c1','c2']})
d1

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2

In [56]:
d2=pd.DataFrame({'x':['x0','x1','x2'],'y':['y0','y1','y2'],'z':['z0','z1','z2']})
d2

    x   y   z
0  x0  y0  z0
1  x1  y1  z1
2  x2  y2  z2

In [57]:
pd.concat([d1,d2]) # by default axis=0

     a    b    c    x    y    z
0   a0   b0   c0  NaN  NaN  NaN
1   a1   b1   c1  NaN  NaN  NaN
2   a2   b2   c2  NaN  NaN  NaN
0  NaN  NaN  NaN   x0   y0   z0
1  NaN  NaN  NaN   x1   y1   z1
2  NaN  NaN  NaN   x2   y2   z2

In [58]:
pd.concat([d1,d2],axis=1)

    a   b   c   x   y   z
0  a0  b0  c0  x0  y0  z0
1  a1  b1  c1  x1  y1  z1
2  a2  b2  c2  x2  y2  z2

# Merging

In [59]:
A=pd.DataFrame({'p':['p1','p2','p3'],
               'q':['q1','q2','q3'],
               'r':['r1','r2','r3']})

In [60]:

B=pd.DataFrame({'p':['p0','p2','p3'],
               's':['s1','s2','s3'],
               't':['t1','t2','t3']})

In [61]:
A

    p   q   r
0  p1  q1  r1
1  p2  q2  r2
2  p3  q3  r3

In [62]:
B

    p   s   t
0  p0  s1  t1
1  p2  s2  t2
2  p3  s3  t3

In [63]:
pd.merge(A,B,how='inner') ## by default it is intersection

    p   q   r   s   t
0  p2  q2  r2  s2  t2
1  p3  q3  r3  s3  t3

In [64]:
pd.merge(A,B,how='outer')  ## it is union

    p    q    r    s    t
0  p1   q1   r1  NaN  NaN
1  p2   q2   r2   s2   t2
2  p3   q3   r3   s3   t3
3  p0  NaN  NaN   s1   t1

In [65]:
pd.merge(A,B,how='right') ## it is for B

    p    q    r   s   t
0  p0  NaN  NaN  s1  t1
1  p2   q2   r2  s2  t2
2  p3   q3   r3  s3  t3

In [66]:
pd.merge(A,B,how='left') ## it is forA

    p   q   r    s    t
0  p1  q1  r1  NaN  NaN
1  p2  q2  r2   s2   t2
2  p3  q3  r3   s3   t3

# joining

In [67]:
X=pd.DataFrame({'a':['a0','a1','a2'],
               'b':['b0','b1','b2']},
              index=['k0','k1','k2'])

In [68]:
Y=pd.DataFrame({'c':['c0','c1','c2'],
               'd':['d0','d1','d2']},
              index=['k1','k2','k3'])

In [69]:
X

     a   b
k0  a0  b0
k1  a1  b1
k2  a2  b2

In [70]:
Y

     c   d
k1  c0  d0
k2  c1  d1
k3  c2  d2

In [71]:
X.join(Y) ## it takes x index

     a   b    c    d
k0  a0  b0  NaN  NaN
k1  a1  b1   c0   d0
k2  a2  b2   c1   d1

In [72]:
Y.join(X) ## it takes y index

     c   d    a    b
k1  c0  d0   a1   b1
k2  c1  d1   a2   b2
k3  c2  d2  NaN  NaN

In [73]:
X.join(Y,how='inner')

     a   b   c   d
k1  a1  b1  c0  d0
k2  a2  b2  c1  d1

In [74]:
Y.join(X,how='inner')

     c   d   a   b
k1  c0  d0  a1  b1
k2  c1  d1  a2  b2

In [75]:
X.join(Y,how='outer')

      a    b    c    d
k0   a0   b0  NaN  NaN
k1   a1   b1   c0   d0
k2   a2   b2   c1   d1
k3  NaN  NaN   c2   d2

In [76]:
Y.join(X,how='outer')

      c    d    a    b
k0  NaN  NaN   a0   b0
k1   c0   d0   a1   b1
k2   c1   d1   a2   b2
k3   c2   d2  NaN  NaN

In [77]:
X.join(Y,how='right') ## right for oposite index

      a    b   c   d
k1   a1   b1  c0  d0
k2   a2   b2  c1  d1
k3  NaN  NaN  c2  d2

In [78]:
Y.join(X,how='right')

      c    d   a   b
k0  NaN  NaN  a0  b0
k1   c0   d0  a1  b1
k2   c1   d1  a2  b2

In [79]:
X.join(Y,how='left')  ##it takes x index

     a   b    c    d
k0  a0  b0  NaN  NaN
k1  a1  b1   c0   d0
k2  a2  b2   c1   d1

In [80]:
Y.join(X,how='left') # it takes y index

     c   d    a    b
k1  c0  d0   a1   b1
k2  c1  d1   a2   b2
k3  c2  d2  NaN  NaN

# operations

In [81]:
pd.DataFrame({'c1':[1,2,3,4,5,6,7,8,9],
             'c2':[111,222,333,444,555,666,777,888,999],
             'c3':['abc','def','ghi','jkl','mno','pqr','stu','vwx','xyz']})

   c1   c2   c3
0   1  111  abc
1   2  222  def
2   3  333  ghi
3   4  444  jkl
4   5  555  mno
5   6  666  pqr
6   7  777  stu
7   8  888  vwx
8   9  999  xyz

In [82]:
df

          L         M         N         O
0 -0.509081 -0.565409  1.168968 -0.578558
1 -1.105452  0.385495  0.479701 -0.399410
2  0.342392 -0.462359  1.560947 -0.350890

# head... to display first five rows of the data
# tail... to display last five rows of the data

In [83]:
df.head()

          L         M         N         O
0 -0.509081 -0.565409  1.168968 -0.578558
1 -1.105452  0.385495  0.479701 -0.399410
2  0.342392 -0.462359  1.560947 -0.350890

In [84]:
df.tail()

          L         M         N         O
0 -0.509081 -0.565409  1.168968 -0.578558
1 -1.105452  0.385495  0.479701 -0.399410
2  0.342392 -0.462359  1.560947 -0.350890

In [85]:
df.head(2)

          L         M         N         O
0 -0.509081 -0.565409  1.168968 -0.578558
1 -1.105452  0.385495  0.479701 -0.399410

In [86]:
df.columns # displays all the columns in the data

Index(['L', 'M', 'N', 'O'], dtype='object')

In [87]:
df.index # displays the row index

RangeIndex(start=0, stop=3, step=1)

In [89]:
dfs=pd.DataFrame({'c1':[1,2,3,4,5,6,7,8,9],
                 'c2':[111,333,555,777,999,222,444,666,888],
                 'c3':['asd','dfg','ght','hyr','ueh','kio','qwv','oup','bmm']})

In [90]:
dfs

   c1   c2   c3
0   1  111  asd
1   2  333  dfg
2   3  555  ght
3   4  777  hyr
4   5  999  ueh
5   6  222  kio
6   7  444  qwv
7   8  666  oup
8   9  888  bmm

## sorting values

In [94]:
dfs.sort_values(by='c2')

   c1   c2   c3
0   1  111  asd
5   6  222  kio
1   2  333  dfg
6   7  444  qwv
2   3  555  ght
7   8  666  oup
3   4  777  hyr
8   9  888  bmm
4   5  999  ueh

In [95]:
dfs.sort_values(by='c3')

   c1   c2   c3
0   1  111  asd
8   9  888  bmm
1   2  333  dfg
2   3  555  ght
3   4  777  hyr
5   6  222  kio
7   8  666  oup
6   7  444  qwv
4   5  999  ueh

In [98]:
dfs.sort_values(by='c2',ascending=False)

   c1   c2   c3
4   5  999  ueh
8   9  888  bmm
3   4  777  hyr
7   8  666  oup
2   3  555  ght
6   7  444  qwv
1   2  333  dfg
5   6  222  kio
0   1  111  asd

In [99]:
dfs[['c1','c2']]

   c1   c2
0   1  111
1   2  333
2   3  555
3   4  777
4   5  999
5   6  222
6   7  444
7   8  666
8   9  888

In [101]:
dfs['c2'].max()

999

In [102]:
dfs.isnull().sum()

c1    0
c2    0
c3    0
dtype: int64

In [103]:
dfs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      9 non-null      int64
 1   c2      9 non-null      int64
 2   c3      9 non-null      object
dtypes: int64(2), object(1)
memory usage: 344.0+ bytes

#### import the Data
#### import the Excel files
#### import the libraries

In [121]:
daa=pd.read_excel("C:\\Users\\Admin\\Downloads\\orange and apple.xlsx")

In [3]:
import numpy as np
import pandas as pd

In [ ]:
data1=pd.read_csv("Filename.csv")